performance-test-reports/automated-security-tests/12648629563/1/user-registration/user_registration/run.log
-    █ [Create Account Service]

-      █ should be able to register new user successfully

-        ✓ is status 200
-        ✓ response body
-        ✓ expected status to equal 200
-        ✓ expected user registration api response to equal 'User Registered'

-    checks.........................: 100.00% ✓ 2400     ✗ 0    
-    data_received..................: 115 kB  1.9 kB/s
-    data_sent......................: 166 kB  2.8 kB/s
-    group_duration.................: avg=7.4ms    min=2.56ms   med=3.06ms   max=913.54ms p(90)=3.79ms   p(95)=6.55ms  
-    http_req_blocked...............: avg=174.5µs  min=127.54µs med=168.44µs max=401.45µs p(90)=214.73µs p(95)=230.04µs
-    http_req_connecting............: avg=126.71µs min=92.84µs  med=121.48µs max=344.81µs p(90)=155.47µs p(95)=170.88µs
-  ✓ http_req_duration..............: avg=6.38ms   min=1.66ms   med=2.07ms   max=912.29ms p(90)=2.63ms   p(95)=5.42ms  
-      { expected_response:true }...: avg=6.38ms   min=1.66ms   med=2.07ms   max=912.29ms p(90)=2.63ms   p(95)=5.42ms  
-  ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 600  
-    http_req_receiving.............: avg=60.23µs  min=36.93µs  med=59.14µs  max=217.67µs p(90)=74.18µs  p(95)=81.6µs  
-    http_req_sending...............: avg=37.94µs  min=17.2µs   med=36.87µs  max=84.81µs  p(90)=51.07µs  p(95)=55.37µs 
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=6.28ms   min=1.57ms   med=1.97ms   max=912.16ms p(90)=2.54ms   p(95)=5.33ms  
-    http_reqs......................: 600     9.998909/s
-    iteration_duration.............: avg=7.45ms   min=2.61ms   med=3.11ms   max=913.58ms p(90)=3.84ms   p(95)=6.59ms  
-    iterations.....................: 600     9.998909/s
-    vus............................: 0       min=0      max=2  
-    vus_max........................: 200     min=200    max=200